Revit 2027 API
Connector.ElectricalSystemType Property
The electrical system type of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElectricalSystemType ElectricalSystemType { get; }
Public ReadOnly Property ElectricalSystemType As ElectricalSystemType
	Get
public:
property ElectricalSystemType ElectricalSystemType {
	ElectricalSystemType get ();
}
member ElectricalSystemType : ElectricalSystemType with get
Property Value
ElectricalSystemType
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the connector's domain is not of DomainElectrical.
InvalidOperationException |  Thrown on failure to get electrical system type.
Remarks
Instantaneous system type at this connector, calculated according to system. For unconnected connectors, system type is undefined.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace